Documents/СогласованиеКомплектовЗаказчиком.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>СогласованиеКомплектовЗаказчиком</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Комплекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаСогласования</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комплект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Композиции</v8:Type>
								<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ДатыСогласования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДатыСогласования</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаСогласованияАрхитектором</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСогласованияДизайнером</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСогласованияЗаказчиком</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументИзменения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СогласованиеКомплектовЗаказчиком</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Комплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Композиции</v8:Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/СогласованиеКомплектовЗаказчиком/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПустаяДата 				= Дата(1, 1, 1);
	ПустаяСсылкаДокумент 	= Документы.СогласованиеКомплектовЗаказчиком.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДатыСогласования.Комплект КАК Комплект
		|ИЗ
		|	РегистрСведений.ДатыСогласования КАК ДатыСогласования
		|ГДЕ
		|	ДатыСогласования.ДокументИзменения = &ДокументИзменения
		|	И НЕ ДатыСогласования.Комплект В (&Комплект)
		|	И ДатыСогласования.ДатаСогласованияЗаказчиком > ДАТАВРЕМЯ(1, 1, 1)";
	
	Запрос.УстановитьПараметр("ДокументИзменения", Ссылка);
	Запрос.УстановитьПараметр("Комплект", Комплекты.ВыгрузитьКолонку("Комплект"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		МенеджерЗаписи = РегистрыСведений.ДатыСогласования.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Комплект = Выборка.Комплект;
		МенеджерЗаписи.Прочитать();
		
		МенеджерЗаписи.ДатаСогласованияЗаказчиком 	= ПустаяДата;
		МенеджерЗаписи.ДокументИзменения 			= ПустаяСсылкаДокумент;
		
		МенеджерЗаписи.Записать();
		
	КонецЦикла;
	
	
	Для каждого ТекущаяСтрока Из Комплекты Цикл
	
		МенеджерЗаписи = РегистрыСведений.ДатыСогласования.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Комплект = ТекущаяСтрока.Комплект;
		МенеджерЗаписи.Прочитать();
		
		МенеджерЗаписи.ДокументИзменения 			= Ссылка;
		МенеджерЗаписи.Комплект 					= ТекущаяСтрока.Комплект;
		МенеджерЗаписи.ДатаСогласованияЗаказчиком 	= ТекущаяСтрока.ДатаСогласования;
		
		МенеджерЗаписи.Записать();
		
	КонецЦикла;
	
КонецПроцедуры
